<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"e79db90f02fe231462cf02c634fc64d08cf25b91646628c8e8a57b77e3785f8d","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1695 at https://github.com/cal-itp/data-infra/actions/runs/23755386612","plan_out_hash":"85236bc0d8611b4116a4e50b4b99cef310cc5439fcc5882d4fcad62bce7c1cf7","plan_hash":"7f2753492807b2282f9cc07e3820c06c13a5dd2c91cd733e573d8a3577fde224","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "pFPdcA==" -> (known after apply)
!~      detect_md5hash      = "fZS7j87rPHKpGuLCyuAyfg==" -> "different hash"
!~      generation          = 1774619659068310 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "fZS7j87rPHKpGuLCyuAyfg==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "DXB9Bg==" -> (known after apply)
!~      detect_md5hash      = "Y1/Unh/vUx7D9T+Qo5y10w==" -> "different hash"
!~      generation          = 1774619660906890 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "Y1/Unh/vUx7D9T+Qo5y10w==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1695](https://github.com/cal-itp/data-infra/actions/runs/23755386612)